# Groupby

In [18]:
import pandas as pd
# Create dataframe
data1 = {'Location':['PUNE','MYS','HYDB','MYS','PUNE','MYS'],
       'Person':['Ram','Harish','Anand','Sudha','Sumegha','Melvin'],
       'Sales':[1200,1140,1340,1124,2143,1350]}

In [19]:
df1 = pd.DataFrame(data1)

In [20]:
df1

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1350

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  6 non-null      object
 1   Person    6 non-null      object
 2   Sales     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [22]:
# grouping based on Location
df1.groupby('Location')

In [23]:
by_location = df1.groupby("Location")

In [24]:
by_location

In [25]:
df1

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1350

In [38]:
by_location.mean() #applying aggregate method on it

                Sales
Location
HYDB      1340.000000
MYS       1204.666667
PUNE      1671.500000

In [39]:
# all together
df1.groupby('Location').mean()

                Sales
Location
HYDB      1340.000000
MYS       1204.666667
PUNE      1671.500000

In [40]:
by_location.std() #for standard deviation

               Sales
Location
HYDB             NaN
MYS       126.116348
PUNE      666.801695

In [41]:
by_location.min()

          Person  Sales
Location
HYDB       Anand   1340
MYS       Harish   1124
PUNE         Ram   1200

In [30]:
df1

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1350

In [42]:
by_location.max()

           Person  Sales
Location
HYDB        Anand   1340
MYS         Sudha   1350
PUNE      Sumegha   2143

In [43]:
by_location.count()

          Person  Sales
Location
HYDB           1      1
MYS            3      3
PUNE           2      2